server-side/app/controllers/trips_controller.rb

    p '*' * 100
    p final_response = JSON.parse(request.response.body)
        # ERROR HANDLING: Ensuring that api_call is returning a response with respect to the user's input
        if final_response['trips']['data'].size < 2
          @invalid_input = "No flights found with provided inputs. Please consider a different date or budget."
        else
          duration = final_response['trips']['tripOption'][0]['slice'][0]['duration']
          depart_time = final_response['trips']['tripOption'][0]['slice'][0]['segment'].first['leg'][0]['departureTime']
---
SELECT  "trips".* FROM "trips"  ORDER BY "trips"."id" ASC LIMIT 1
SELECT  "trips".* FROM "trips"  ORDER BY "trips"."id" DESC LIMIT 5

          destination_code = final_response['trips']['tripOption'][0]['slice'][0]['segment'].last['leg'][0]['destination']
          destination = find_city(destination_code, final_response)

          Trip.create(sale_total: sale_total, carrier: carrier, carrier_code: carrier_code, flight_number: flight_number, depart_time: depart_time, arrival_time: arrival_time, duration: duration, origin: origin, destination_code: destination_code, destination: destination)
---
INSERT INTO "trips" ("carrier_code", "flight_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["carrier_code", "KE"], ["flight_number", "468"], ["created_at", "2015-03-08 06:27:37.685776"], ["updated_at", "2015-03-08 06:27:37.685776"]]